app/controllers/users_controller.rb

INSERT INTO "users" ("userName", "firstName", "lastName", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["userName", "yoav777"], ["firstName", "Yoav"], ["lastName", "Navon"], ["role", 0], ["created_at", "2018-04-13 13:24:07.119480"], ["updated_at", "2018-04-13 13:24:07.119480"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save